Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ry.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-001/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-137"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-137/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-027"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-027/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-069"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-069/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-scale-02"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-scale-02/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-gpu-01"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-gpu-01/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-scale-04"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-scale-04/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-011"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-011/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-scale-23"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-scale-23/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-018"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-018/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-066"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-066/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-047"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-047/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-154"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-154/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-051"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-051/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-086"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-086/locations/us/repositories/gcr.io]
module.artifact_registry["k8s-infra-e2e-boskos-scale-13"].google_artifact_registry_repository.repo: Refreshing state... [id=projects/k8s-infra-e2e-boskos-scale-13/locations/us/repositories/gcr.io]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # google_compute_project_metadata.default["k8s-infra-e2e-gce-project"] will be updated in-place
  # (imported from "k8s-infra-e2e-gce-project")
  ~ resource "google_compute_project_metadata" "default" {
        id       = "k8s-infra-e2e-gce-project"
      ~ metadata = {
          + "enable-oslogin" = "FALSE"
            "ssh-keys"       = <<-EOT
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCmYxHh/wwcV0P1aChuFLpl28w6DFyc7G5Xrw1F8wH1Re9AdxyemM2bTZ/PhsP3u9VDnNbyOw3UN00VFdumkFLjLf1WQ7Q6rZDlPjlw7urBIvAMqUecY6ae1znqsZ0dMBxOuPXHznlnjLjM5b7O7q5WsQMCA9Szbmz6DsuSyCuX0It2osBTN+8P/Fa6BNh3W8AF60M7L8/aUzLfbXVS2LIQKAHHD8CWqvXhLPuTJ03iSwFvgtAK1/J2XJwUP+OzAFrxj6A9LW5ZZgk3R3kRKr0xT/L7hga41rB1qy8Uz+Xr/PTVMNGW+nmU4bPgFchCK0JBK7B12ZcdVVFUEdpaAiKZ prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
            EOT
        }
        project  = "k8s-infra-e2e-gce-project"
    }

  # google_compute_project_metadata.default["k8s-infra-e2e-gpu-project"] will be updated in-place
  # (imported from "k8s-infra-e2e-gpu-project")
  ~ resource "google_compute_project_metadata" "default" {
        id       = "k8s-infra-e2e-gpu-project"
      ~ metadata = {
          + "enable-oslogin" = "FALSE"
            "ssh-keys"       = <<-EOT
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCmYxHh/wwcV0P1aChuFLpl28w6DFyc7G5Xrw1F8wH1Re9AdxyemM2bTZ/PhsP3u9VDnNbyOw3UN00VFdumkFLjLf1WQ7Q6rZDlPjlw7urBIvAMqUecY6ae1znqsZ0dMBxOuPXHznlnjLjM5b7O7q5WsQMCA9Szbmz6DsuSyCuX0It2osBTN+8P/Fa6BNh3W8AF60M7L8/aUzLfbXVS2LIQKAHHD8CWqvXhLPuTJ03iSwFvgtAK1/J2XJwUP+OzAFrxj6A9LW5ZZgk3R3kRKr0xT/L7hga41rB1qy8Uz+Xr/PTVMNGW+nmU4bPgFchCK0JBK7B12ZcdVVFUEdpaAiKZ prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
            EOT
        }
        project  = "k8s-infra-e2e-gpu-project"
    }

  # google_compute_project_metadata.default["k8s-infra-e2e-ingress-project"] will be updated in-place
  # (imported from "k8s-infra-e2e-ingress-project")
  ~ resource "google_compute_project_metadata" "default" {
        id       = "k8s-infra-e2e-ingress-project"
      ~ metadata = {
          + "enable-oslogin" = "FALSE"
            "ssh-keys"       = <<-EOT
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCmYxHh/wwcV0P1aChuFLpl28w6DFyc7G5Xrw1F8wH1Re9AdxyemM2bTZ/PhsP3u9VDnNbyOw3UN00VFdumkFLjLf1WQ7Q6rZDlPjlw7urBIvAMqUecY6ae1znqsZ0dMBxOuPXHznlnjLjM5b7O7q5WsQMCA9Szbmz6DsuSyCuX0It2osBTN+8P/Fa6BNh3W8AF60M7L8/aUzLfbXVS2LIQKAHHD8CWqvXhLPuTJ03iSwFvgtAK1/J2XJwUP+OzAFrxj6A9LW5ZZgk3R3kRKr0xT/L7hga41rB1qy8Uz+Xr/PTVMNGW+nmU4bPgFchCK0JBK7B12ZcdVVFUEdpaAiKZ prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
            EOT
        }
        project  = "k8s-infra-e2e-ingress-project"
    }

  # google_compute_project_metadata.default["k8s-infra-e2e-node-e2e-project"] will be updated in-place
  # (imported from "k8s-infra-e2e-node-e2e-project")
  ~ resource "google_compute_project_metadata" "default" {
        id       = "k8s-infra-e2e-node-e2e-project"
      ~ metadata = {
          + "enable-oslogin" = "FALSE"
            "ssh-keys"       = <<-EOT
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCmYxHh/wwcV0P1aChuFLpl28w6DFyc7G5Xrw1F8wH1Re9AdxyemM2bTZ/PhsP3u9VDnNbyOw3UN00VFdumkFLjLf1WQ7Q6rZDlPjlw7urBIvAMqUecY6ae1znqsZ0dMBxOuPXHznlnjLjM5b7O7q5WsQMCA9Szbmz6DsuSyCuX0It2osBTN+8P/Fa6BNh3W8AF60M7L8/aUzLfbXVS2LIQKAHHD8CWqvXhLPuTJ03iSwFvgtAK1/J2XJwUP+OzAFrxj6A9LW5ZZgk3R3kRKr0xT/L7hga41rB1qy8Uz+Xr/PTVMNGW+nmU4bPgFchCK0JBK7B12ZcdVVFUEdpaAiKZ prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
            EOT
        }
        project  = "k8s-infra-e2e-node-e2e-project"
    }

  # google_compute_project_metadata.default["k8s-infra-e2e-scale-5k-project"] will be updated in-place
  # (imported from "k8s-infra-e2e-scale-5k-project")
  ~ resource "google_compute_project_metadata" "default" {
        id       = "k8s-infra-e2e-scale-5k-project"
      ~ metadata = {
          + "enable-oslogin" = "FALSE"
            "ssh-keys"       = <<-EOT
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCmYxHh/wwcV0P1aChuFLpl28w6DFyc7G5Xrw1F8wH1Re9AdxyemM2bTZ/PhsP3u9VDnNbyOw3UN00VFdumkFLjLf1WQ7Q6rZDlPjlw7urBIvAMqUecY6ae1znqsZ0dMBxOuPXHznlnjLjM5b7O7q5WsQMCA9Szbmz6DsuSyCuX0It2osBTN+8P/Fa6BNh3W8AF60M7L8/aUzLfbXVS2LIQKAHHD8CWqvXhLPuTJ03iSwFvgtAK1/J2XJwUP+OzAFrxj6A9LW5ZZgk3R3kRKr0xT/L7hga41rB1qy8Uz+Xr/PTVMNGW+nmU4bPgFchCK0JBK7B12ZcdVVFUEdpaAiKZ prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCwi6eXzsTjaeveXEfdbKBVD1oyX8fNwlETQVUctA56HxlxAbg0oKIGDoc04O4eWiamRKdIzc9WZIS/I56vVxcA0zBl/jwsnRpOpaUZh/wgXQtXa+/k3B7tZTZxeao1gefEUzUXJWr92QYZFrA0D82QdixqDpZfEPc8OeKeObfnKWPOZNtXt5X8b9VhzhmFUNPyzG6Tr2Mv8NGh/lrnA+nBCe+Yiw+8is4fLGhQmidw1xX2zLS65nJfmEhaqQObbDCqrAmAP0CXSOBCsZhcU2ibi8VLKCzcmhpAdhdbwW/kaeNHQSXkcAy0hkxGy41stNXDvkJPEKeCuUvA+ZB48G3PvMQ7yCr8JK6cHdxOJLr5NcxjREIk7wkwhL07MCU+keVufWwUP3H8vXR5CtI8soCSBW7QnmhQfToHkdnsYC0S9zIndx1K7ZGKlQbVQc+FLOXNtlYXc3XH7wf0PNcVActlhMG6CIPjiU7jFcmnbqASyX/qSMreBcqpojNeA08x4Rk= prow
            EOT
        }
        project  = "k8s-infra-e2e-scale-5k-project"
    }

  # google_compute_project_metadata.default["k8s-infra-e2e-scale-project"] will be updated in-place
  # (imported from "k8s-infra-e2e-scale-project")
  ~ resource "google_compute_project_metadata" "default" {
        id       = "k8s-infra-e2e-scale-project"
      ~ metadata = {
          + "enable-oslogin" = "FALSE"
            "ssh-keys"       = <<-EOT
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCmYxHh/wwcV0P1aChuFLpl28w6DFyc7G5Xrw1F8wH1Re9AdxyemM2bTZ/PhsP3u9VDnNbyOw3UN00VFdumkFLjLf1WQ7Q6rZDlPjlw7urBIvAMqUecY6ae1znqsZ0dMBxOuPXHznlnjLjM5b7O7q5WsQMCA9Szbmz6DsuSyCuX0It2osBTN+8P/Fa6BNh3W8AF60M7L8/aUzLfbXVS2LIQKAHHD8CWqvXhLPuTJ03iSwFvgtAK1/J2XJwUP+OzAFrxj6A9LW5ZZgk3R3kRKr0xT/L7hga41rB1qy8Uz+Xr/PTVMNGW+nmU4bPgFchCK0JBK7B12ZcdVVFUEdpaAiKZ prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
            EOT
        }
        project  = "k8s-infra-e2e-scale-project"
    }

  # module.artifact_registry["k8s-infra-e2e-gce-project"].google_artifact_registry_repository.repo will be updated in-place
  # (imported from "projects/k8s-infra-e2e-gce-project/locations/us/repositories/gcr.io")
  ~ resource "google_artifact_registry_repository" "repo" {
      ~ cleanup_policy_dry_run = true -> false
        create_time            = "2025-10-06T20:49:19.725476Z"
        description            = null
        effective_labels       = {}
        format                 = "DOCKER"
        id                     = "projects/k8s-infra-e2e-gce-project/locations/us/repositories/gcr.io"
        kms_key_name           = null
        labels                 = {}
        location               = "us"
        mode                   = "STANDARD_REPOSITORY"
        name                   = "gcr.io"
        project                = "k8s-infra-e2e-gce-project"
        repository_id          = "gcr.io"
        terraform_labels       = {}
        update_time            = "2025-10-06T20:49:19.725476Z"

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
                newer_than            = null
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
            }
        }

      - docker_config {
          - immutable_tags = false -> null
        }

        vulnerability_scanning_config {
            enablement_config       = "INHERITED"
            enablement_state        = "SCANNING_DISABLED"
            enablement_state_reason = "API containerscanning.googleapis.com is not enabled."
        }
    }

  # module.artifact_registry["k8s-infra-e2e-gpu-project"].google_artifact_registry_repository.repo will be updated in-place
  # (imported from "projects/k8s-infra-e2e-gpu-project/locations/us/repositories/gcr.io")
  ~ resource "google_artifact_registry_repository" "repo" {
      ~ cleanup_policy_dry_run = true -> false
        create_time            = "2025-10-06T20:49:05.385854Z"
        description            = null
        effective_labels       = {}
        format                 = "DOCKER"
        id                     = "projects/k8s-infra-e2e-gpu-project/locations/us/repositories/gcr.io"
        kms_key_name           = null
        labels                 = {}
        location               = "us"
        mode                   = "STANDARD_REPOSITORY"
        name                   = "gcr.io"
        project                = "k8s-infra-e2e-gpu-project"
        repository_id          = "gcr.io"
        terraform_labels       = {}
        update_time            = "2025-10-06T20:49:05.385854Z"

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
                newer_than            = null
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
            }
        }

      - docker_config {
          - immutable_tags = false -> null
        }

        vulnerability_scanning_config {
            enablement_config       = "INHERITED"
            enablement_state        = "SCANNING_DISABLED"
            enablement_state_reason = "API containerscanning.googleapis.com is not enabled."
        }
    }

  # module.artifact_registry["k8s-infra-e2e-ingress-project"].google_artifact_registry_repository.repo will be updated in-place
  # (imported from "projects/k8s-infra-e2e-ingress-project/locations/us/repositories/gcr.io")
  ~ resource "google_artifact_registry_repository" "repo" {
      ~ cleanup_policy_dry_run = true -> false
        create_time            = "2025-10-06T20:48:24.094666Z"
        description            = null
        effective_labels       = {}
        format                 = "DOCKER"
        id                     = "projects/k8s-infra-e2e-ingress-project/locations/us/repositories/gcr.io"
        kms_key_name           = null
        labels                 = {}
        location               = "us"
        mode                   = "STANDARD_REPOSITORY"
        name                   = "gcr.io"
        project                = "k8s-infra-e2e-ingress-project"
        repository_id          = "gcr.io"
        terraform_labels       = {}
        update_time            = "2025-10-06T20:48:24.094666Z"

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
                newer_than            = null
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
            }
        }

      - docker_config {
          - immutable_tags = false -> null
        }

        vulnerability_scanning_config {
            enablement_config       = "INHERITED"
            enablement_state        = "SCANNING_DISABLED"
            enablement_state_reason = "API containerscanning.googleapis.com is not enabled."
        }
    }

  # module.artifact_registry["k8s-infra-e2e-node-e2e-project"].google_artifact_registry_repository.repo will be updated in-place
  # (imported from "projects/k8s-infra-e2e-node-e2e-project/locations/us/repositories/gcr.io")
  ~ resource "google_artifact_registry_repository" "repo" {
      ~ cleanup_policy_dry_run = true -> false
        create_time            = "2025-10-06T20:49:56.522122Z"
        description            = null
        effective_labels       = {}
        format                 = "DOCKER"
        id                     = "projects/k8s-infra-e2e-node-e2e-project/locations/us/repositories/gcr.io"
        kms_key_name           = null
        labels                 = {}
        location               = "us"
        mode                   = "STANDARD_REPOSITORY"
        name                   = "gcr.io"
        project                = "k8s-infra-e2e-node-e2e-project"
        repository_id          = "gcr.io"
        terraform_labels       = {}
        update_time            = "2025-10-06T20:49:56.522122Z"

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
                newer_than            = null
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
            }
        }

      - docker_config {
          - immutable_tags = false -> null
        }

        vulnerability_scanning_config {
            enablement_config       = "INHERITED"
            enablement_state        = "SCANNING_DISABLED"
            enablement_state_reason = "API containerscanning.googleapis.com is not enabled."
        }
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
      + folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-gce-project"
        name                = "k8s-infra-e2e-gce-project"
      - org_id              = "758905017065" -> null
        # (7 unchanged attributes hidden)
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
      + folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-gpu-project"
        name                = "k8s-infra-e2e-gpu-project"
      - org_id              = "758905017065" -> null
        # (7 unchanged attributes hidden)
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
      + folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-ingress-project"
        name                = "k8s-infra-e2e-ingress-project"
      - org_id              = "758905017065" -> null
        # (7 unchanged attributes hidden)
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
      + folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-node-e2e-project"
        name                = "k8s-infra-e2e-node-e2e-project"
      - org_id              = "758905017065" -> null
        # (7 unchanged attributes hidden)
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
      + folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-scale-5k-project"
        name                = "k8s-infra-e2e-scale-5k-project"
      - org_id              = "758905017065" -> null
        # (7 unchanged attributes hidden)
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.google_project.main will be updated in-place
  ~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
      + folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-scale-project"
        name                = "k8s-infra-e2e-scale-project"
      - org_id              = "758905017065" -> null
        # (7 unchanged attributes hidden)
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudasset.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "cloudasset.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "cloudbuild.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "cloudkms.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudscheduler.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "cloudscheduler.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "compute.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "container.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["file.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "file.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "logging.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "monitoring.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gce-project"].module.project-factory.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gce-project"
      + service                    = "secretmanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudasset.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "cloudasset.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "cloudbuild.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "cloudkms.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudscheduler.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "cloudscheduler.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "compute.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "container.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["file.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "file.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "logging.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "monitoring.googleapis.com"
    }

  # module.project["k8s-infra-e2e-gpu-project"].module.project-factory.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-gpu-project"
      + service                    = "secretmanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudasset.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "cloudasset.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "cloudbuild.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "cloudkms.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudscheduler.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "cloudscheduler.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "compute.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "container.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["file.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "file.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "logging.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "monitoring.googleapis.com"
    }

  # module.project["k8s-infra-e2e-ingress-project"].module.project-factory.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-ingress-project"
      + service                    = "secretmanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudasset.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "cloudasset.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "cloudbuild.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "cloudkms.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudscheduler.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "cloudscheduler.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "compute.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "container.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["file.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "file.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "logging.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "monitoring.googleapis.com"
    }

  # module.project["k8s-infra-e2e-node-e2e-project"].module.project-factory.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-node-e2e-project"
      + service                    = "secretmanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudasset.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "cloudasset.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "cloudbuild.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "cloudkms.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudscheduler.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "cloudscheduler.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "compute.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "container.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["file.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "file.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "logging.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "monitoring.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-5k-project"].module.project-factory.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-5k-project"
      + service                    = "secretmanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudasset.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "cloudasset.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "cloudbuild.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "cloudkms.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["cloudscheduler.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "cloudscheduler.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "compute.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "container.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["file.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "file.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "logging.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "monitoring.googleapis.com"
    }

  # module.project["k8s-infra-e2e-scale-project"].module.project-factory.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "k8s-infra-e2e-scale-project"
      + service                    = "secretmanager.googleapis.com"
    }

Plan: 10 to import, 78 to add, 16 to change, 0 to destroy.
╷
│ Error: Cannot import non-existent remote object
│ 
│ While attempting to import an existing object to
│ "module.artifact_registry[\"k8s-infra-e2e-scale-5k-project\"].google_artifact_registry_repository.repo",
│ the provider detected that no object exists with the given id. Only
│ pre-existing objects can be imported; check that the id is correct and that
│ it is associated with the provider's configured region or endpoint, or use
│ "terraform apply" to create a new remote object for this resource.
╵
╷
│ Error: Cannot import non-existent remote object
│ 
│ While attempting to import an existing object to
│ "module.artifact_registry[\"k8s-infra-e2e-scale-project\"].google_artifact_registry_repository.repo",
│ the provider detected that no object exists with the given id. Only
│ pre-existing objects can be imported; check that the id is correct and that
│ it is associated with the provider's configured region or endpoint, or use
│ "terraform apply" to create a new remote object for this resource.
╵


```
</details>